clusterMHDTest/Alfven2D/64/HLLC-L/0/B
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      B;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0.5 -0.5 -1 0 0 0 0];

internalField   nonuniform List<vector> 
3969
(
(0.866025 0.5 0.1)
(0.871004 0.491377 0.0995031)
(0.875933 0.48284 0.0980172)
(0.880763 0.474473 0.0955573)
(0.885447 0.466361 0.0921476)
(0.889938 0.458582 0.0878222)
(0.894191 0.451215 0.0826239)
(0.898165 0.444333 0.0766044)
...
)
;

boundaryField
{
    front-back
    {
        type            empty;
    }
    periodic11_half0
    {
        type            cyclic;
    }
    periodic11_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
