clusterMHDTest/Alfven2D/64/HLLC-L/0/Bx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Bx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -2 0 0 -1 0];

internalField   nonuniform List<scalar> 
3969
(
0.866025
0.871004
0.875933
0.880763
0.885447
0.889938
0.894191
0.898165
...
)
;

boundaryField
{
    front-back
    {
        type            empty;
    }
    periodic11_half0
    {
        type            cyclic;
    }
    periodic11_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
