clusterMHDTest/Alfven2D/64/HLLC-L/0/Ma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
3969
(
0.244949
0.244949
0.244949
0.244949
0.244949
0.244949
0.244949
0.244949
...
)
;

boundaryField
{
    front-back
    {
        type            empty;
    }
    periodic11_half0
    {
        type            cyclic;
    }
    periodic11_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
