clusterMHDTest/Alfven2D/64/HLLC-L/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
3969
(
(3.08121e-13 -5.33682e-13 0.1)
(0.00497839 -0.00862283 0.0995031)
(0.00990731 -0.01716 0.0980172)
(0.0147378 -0.0255265 0.0955573)
(0.0194217 -0.0336394 0.0921476)
(0.0239127 -0.041418 0.0878222)
(0.028166 -0.0487849 0.0826239)
(0.0321394 -0.055667 0.0766044)
...
)
;

boundaryField
{
    front-back
    {
        type            empty;
    }
    periodic11_half0
    {
        type            cyclic;
    }
    periodic11_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
