clusterMHDTest/Alfven2D/64/HLLC-L/0/pB1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      pB1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0.5 0.5 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    front-back
    {
        type            empty;
    }
    periodic11_half0
    {
        type            cyclic;
    }
    periodic11_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
